In [1]:
%pip install pyspark
%pip install pandas

Requirement already satisfied: pyspark in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (3.5.0)
Requirement already satisfied: py4j==0.10.9.7 in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (from pyspark) (0.10.9.7)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pandas in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.22.4 in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/aindamutsa/anaconda3/envs/myenv/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pyspark

In [3]:
import pandas as pd
pd.read_csv("test.csv")

         Name   Age  Experience   Salary  Unnamed: 4
0       Krish  22.0         2.0  30000.0         NaN
1   Indamutsa  34.0        10.0      NaN         NaN
2     Chantal   NaN         8.0  20000.0         NaN
3       Armel  33.0         NaN  15000.0         NaN
4       Willy  34.0         3.0  18000.0         NaN
5    Sandrine  23.0        18.0  41000.0         NaN
6       Kevin  52.0        23.0      NaN         NaN
7       Laura  29.0         6.0  22000.0         NaN
8        Jean   NaN        14.0  33000.0         NaN
9   Elizabeth  45.0         NaN  50000.0         NaN
10    Mohamed  31.0         7.0      NaN         NaN
11      Krish  22.0         2.0  30000.0         NaN
12  Indamutsa  34.0        10.0  25000.0         NaN
13    Chantal  44.0         8.0  20000.0         NaN
14      Armel  33.0         5.0  15000.0         NaN
15      Willy  34.0         3.0  18000.0         NaN
16   Sandrine  23.0        18.0  41000.0         NaN
17      Kevin  52.0        23.0      NaN         NaN
18      Laura  29.0         6.0  22000.0         NaN
19       Jean  39.0        14.0  33000.0         NaN
20  Elizabeth  45.0        20.0  50000.0         NaN
21    Mohamed  31.0         7.0  24000.0         NaN
22      Anaïs  28.0         3.0  17000.0         NaN
23      Boris  25.0         1.0  16000.0         NaN
24      Fiona  38.0        12.0  36000.0         NaN
25    Gustavo  47.0        22.0  55000.0         NaN

In [101]:
from pyspark.sql import SparkSession

In [102]:
spark = SparkSession.builder.appName("Practice ").getOrCreate()

24/02/24 19:39:48 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

In [103]:
df_pyspark = spark.read.csv("test.csv")
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [104]:
# df_pyspark.show()
df_pyspark = spark.read.option('header','true').csv('test.csv')
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [105]:
df_pyspark.head(3)

[Row(First Name=None, Department=None, Salary='52534.0', Years of Experience='5.0', Age='52.0'),
 Row(First Name='Olivia', Department='HR', Salary=None, Years of Experience='4.0', Age='51.0'),
 Row(First Name=None, Department='Sales', Salary=None, Years of Experience='11.0', Age=None)]

In [106]:
df_pyspark.printSchema()

root
 |-- First Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- Years of Experience: string (nullable = true)
 |-- Age: string (nullable = true)

### Let us now Learn about:
- PySpark DataFrames
- Reading the DataSet
- Checking the Datatypes of the columns (Schema)
- Selecing Columns and Indexing
- Check Describe option similar to Pandas
- Adding Columns
- Dropping Columns
- Renaming Columns

In [ ]:
from pyspark.sql import SparkSession

In [ ]:
# Start the spark session
spark = SparkSession.builder.appName('DataFrame').getOrCreate()

In [ ]:
# Read the dataset
df_pyspark = spark.read.option('header', 'true').csv('test.csv', inferSchema=True)

In [ ]:
# Check the schema
df_pyspark.printSchema()

In [ ]:
# Another way
# df_pyspark = spark.read.csv('test.csv', header=True, inferSchema=True).show()
df_pyspark = spark.read.csv('test.csv', header=True, inferSchema=True)

In [ ]:
df_pyspark.printSchema()
type(df_pyspark)

In [ ]:
# Checking the Datatypes of the columns (Schema)

# df_pyspark.columns
# df_pyspark.head(3)
# df_pyspark.show()

In [ ]:
# df_pyspark.select('Name').show()
type(df_pyspark.select('Name'))

In [ ]:
df_pyspark.select(['Name', 'Experience'])
# df_pyspark.select(['Name', 'Experience']).show()

In [ ]:
df_pyspark.dtypes

In [ ]:
# Check Describe option similar to Pandas

df_pyspark.describe()
# df_pyspark.describe().show()

In [ ]:
# Adding Columns in dataframe

# df_pyspark.withColumn('Experience After 2 Years', df_pyspark['Experience'] + 2)
df_pyspark = df_pyspark.withColumn('Experience After 2 Years', df_pyspark['Experience'] + 2)
df_pyspark.show()

In [ ]:
# Drop the columns
# df_pyspark.drop('Experience After 2 Years').show()
df_pyspark = df_pyspark.drop('Experience After 2 Years')
df_pyspark.show()

In [ ]:
# Renaming Columns
df_pyspark.withColumnRenamed('Name','New Name').show()

# PySpark DataFrames
- Dropping Columns
- Dropping Rows
- Various Parameter in Dropping functionalities
- Handling Missing Data by Mean, Median and Mode

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Practice').getOrCreate()

24/02/24 15:11:25 WARN Utils: Your hostname, MacIndamutsa-2.local resolves to a loopback address: 127.0.0.1; using 192.168.0.12 instead (on interface en0)
24/02/24 15:11:25 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/02/24 15:11:25 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [5]:
df_pyspark = spark.read.csv('test.csv', header=True, inferSchema=True).drop('_c4')
df_pyspark.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10|  NULL|
|  Chantal|NULL|         8| 20000|
|    Armel|  33|      NULL| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Kevin|  52|        23|  NULL|
|    Laura|  29|         6| 22000|
|     Jean|NULL|        14| 33000|
|Elizabeth|  45|      NULL| 50000|
|  Mohamed|  31|         7|  NULL|
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10| 25000|
|  Chantal|  44|         8| 20000|
|    Armel|  33|         5| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Kevin|  52|        23|  NULL|
|    Laura|  29|         6| 22000|
|     Jean|  39|        14| 33000|
+---------+----+----------+------+
only showing top 20 rows

In [ ]:
## Drop the columns
# df_pyspark.drop('Name').show()
df_pyspark.na.drop().show() # Drop all rows where nan values are present

In [ ]:
### any == how
### how == all
df_pyspark.na.drop(how="any").show()
df_pyspark.na.drop(how="all").show()

In [ ]:
## Threshold
df_pyspark.na.drop(how="any", thresh=2).show()

In [ ]:
## Threshold
df_pyspark.na.drop(how="any", subset=['Age']).show()

In [7]:
## Filling the missing values
# df_pyspark.na.fill(0).show()

# wE can specify the columns you want to change
# df_pyspark.na.fill(0, 'Experience').show()

# We can specify all the columns that needs to be changed
df_pyspark.na.fill(0, ['Experience', 'Salary']).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10|     0|
|  Chantal|NULL|         8| 20000|
|    Armel|  33|         0| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Kevin|  52|        23|     0|
|    Laura|  29|         6| 22000|
|     Jean|NULL|        14| 33000|
|Elizabeth|  45|         0| 50000|
|  Mohamed|  31|         7|     0|
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10| 25000|
|  Chantal|  44|         8| 20000|
|    Armel|  33|         5| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Kevin|  52|        23|     0|
|    Laura|  29|         6| 22000|
|     Jean|  39|        14| 33000|
+---------+----+----------+------+
only showing top 20 rows

In [18]:
# Let us now fill the missing values using median, mean or other summary statistics
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience','Salary']]
).setStrategy("median") # We can check also the medium, mode, and so on

In [19]:
# Add imputation cols to the dataframe
imputer.fit(df_pyspark).transform(df_pyspark).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  22|         2| 30000|         22|                 2|         30000|
|Indamutsa|  34|        10|  NULL|         34|                10|         24000|
|  Chantal|NULL|         8| 20000|         33|                 8|         20000|
|    Armel|  33|      NULL| 15000|         33|                 8|         15000|
|    Willy|  34|         3| 18000|         34|                 3|         18000|
| Sandrine|  23|        18| 41000|         23|                18|         41000|
|    Kevin|  52|        23|  NULL|         52|                23|         24000|
|    Laura|  29|         6| 22000|         29|                 6|         22000|
|     Jean|NULL|        14| 33000|         33|                14|         33000|
|Elizabeth|  45|      NULL| 50000|         45|                 8|         50000|
|  Mohamed|  31|         7|  NULL|         31|                 7|         24000|
|    Krish|  22|         2| 30000|         22|                 2|         30000|
|Indamutsa|  34|        10| 25000|         34|                10|         25000|
|  Chantal|  44|         8| 20000|         44|                 8|         20000|
|    Armel|  33|         5| 15000|         33|                 5|         15000|
|    Willy|  34|         3| 18000|         34|                 3|         18000|
| Sandrine|  23|        18| 41000|         23|                18|         41000|
|    Kevin|  52|        23|  NULL|         52|                23|         24000|
|    Laura|  29|         6| 22000|         29|                 6|         22000|
|     Jean|  39|        14| 33000|         39|                14|         33000|
+---------+----+----------+------+-----------+------------------+--------------+
only showing top 20 rows

## PySpark DataFrames
- Filter Operations
- &,|,==
- ~ for not operation

In [20]:
from pyspark.sql import SparkSession

In [21]:
spark  = SparkSession.builder.appName('dataframe').getOrCreate()

24/02/24 15:32:00 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

In [25]:
df_pyspark = spark.read.csv('test.csv', header=True, inferSchema=True).drop('_c4')
df_pyspark.show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10|  NULL|
|  Chantal|NULL|         8| 20000|
|    Armel|  33|      NULL| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Kevin|  52|        23|  NULL|
|    Laura|  29|         6| 22000|
|     Jean|NULL|        14| 33000|
|Elizabeth|  45|      NULL| 50000|
|  Mohamed|  31|         7|  NULL|
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10| 25000|
|  Chantal|  44|         8| 20000|
|    Armel|  33|         5| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Kevin|  52|        23|  NULL|
|    Laura|  29|         6| 22000|
|     Jean|  39|        14| 33000|
+---------+----+----------+------+
only showing top 20 rows

In [26]:
### Filter operations

# Let us find the salary of people less than or equal to 20000
df_pyspark.filter("Salary <= 20000").show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Chantal|NULL|         8| 20000|
|  Armel|  33|      NULL| 15000|
|  Willy|  34|         3| 18000|
|Chantal|  44|         8| 20000|
|  Armel|  33|         5| 15000|
|  Willy|  34|         3| 18000|
|  Anaïs|  28|         3| 17000|
|  Boris|  25|         1| 16000|
+-------+----+----------+------+

In [27]:
# Let us find the salary of people less than or equal to 20000
df_pyspark.filter("Salary <= 20000").select(['Name', 'Age']).show()

+-------+----+
|   Name| Age|
+-------+----+
|Chantal|NULL|
|  Armel|  33|
|  Willy|  34|
|Chantal|  44|
|  Armel|  33|
|  Willy|  34|
|  Anaïs|  28|
|  Boris|  25|
+-------+----+

In [29]:
df_pyspark.filter(df_pyspark['Salary'] <= 20000).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Chantal|NULL|         8| 20000|
|  Armel|  33|      NULL| 15000|
|  Willy|  34|         3| 18000|
|Chantal|  44|         8| 20000|
|  Armel|  33|         5| 15000|
|  Willy|  34|         3| 18000|
|  Anaïs|  28|         3| 17000|
|  Boris|  25|         1| 16000|
+-------+----+----------+------+

In [32]:
df_pyspark.filter((df_pyspark['Salary'] <= 20000) & (df_pyspark['Salary'] >= 15000)).show()
df_pyspark.filter((df_pyspark['Salary'] <= 20000) | (df_pyspark['Salary'] >= 15000)).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Chantal|NULL|         8| 20000|
|  Armel|  33|      NULL| 15000|
|  Willy|  34|         3| 18000|
|Chantal|  44|         8| 20000|
|  Armel|  33|         5| 15000|
|  Willy|  34|         3| 18000|
|  Anaïs|  28|         3| 17000|
|  Boris|  25|         1| 16000|
+-------+----+----------+------+

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  22|         2| 30000|
|  Chantal|NULL|         8| 20000|
|    Armel|  33|      NULL| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Laura|  29|         6| 22000|
|     Jean|NULL|        14| 33000|
|Elizabeth|  45|      NULL| 50000|
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10| 25000|
|  Chantal|  44|         8| 20000|
|    Armel|  33|         5| 15000|
|    Willy|  34|         3| 18000|
| Sandrine|  23|        18| 41000|
|    Laura|  29|         6| 22000|
|     Jean|  39|        14| 33000|
|Elizabeth|  45|        20| 50000|
|  Mohamed|  31|         7| 24000|
|    Anaïs|  28|         3| 17000|
|    Boris|  25|         1| 16000|
+---------+----+----------+------+
only showing top 20 rows

In [33]:
df_pyspark.filter(~(df_pyspark['Salary'] <= 20000)).show()

+---------+----+----------+------+
|     Name| Age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  22|         2| 30000|
| Sandrine|  23|        18| 41000|
|    Laura|  29|         6| 22000|
|     Jean|NULL|        14| 33000|
|Elizabeth|  45|      NULL| 50000|
|    Krish|  22|         2| 30000|
|Indamutsa|  34|        10| 25000|
| Sandrine|  23|        18| 41000|
|    Laura|  29|         6| 22000|
|     Jean|  39|        14| 33000|
|Elizabeth|  45|        20| 50000|
|  Mohamed|  31|         7| 24000|
|    Fiona|  38|        12| 36000|
|  Gustavo|  47|        22| 55000|
+---------+----+----------+------+

## Groupby and Aggregate Functions

In [64]:
df_emp_data = spark.read.csv('employees_data_enhanced.csv', header=True, inferSchema=True)
df_emp_data.show()

+---------+----------+------+-------------------+---+------+---------+--------------------+
|     Name|Department|Salary|Years_of_Experience|Age|Gender|Full_Time|               Email|
+---------+----------+------+-------------------+---+------+---------+--------------------+
|      Mia|        HR| 77505|                 12| 38|  Male|    false|    emma@example.com|
|  Madison| Marketing|110771|                  3| 25|Female|    false|  olivia@example.com|
|   Sophia|     Sales|103130|                 10| 42|  Male|     true|     ava@example.com|
| Isabella| Marketing| 68541|                  1| 50|Female|    false|isabella@example.com|
|   Harper|     Sales| 50922|                 11| 43|  Male|    false|  sophia@example.com|
|    Emily|        HR| 98046|                  4| 41|  Male|     true|     mia@example.com|
|     Emma|        IT| 72663|                  8| 35|  Male|     true|charlotte@example...|
|   Amelia|        IT| 94510|                  7| 40|  Male|    false|  amelia@example.com|
|  Abigail|        HR| 61821|                 11| 44|  Male|     true|  evelyn@example.com|
| Victoria| Marketing| 68512|                  4| 52|Female|    false| abigail@example.com|
|    Avery|        HR| 53862|                  2| 39|Female|     true|  harper@example.com|
|Charlotte|        HR| 71856|                  9| 55|Female|    false|   emily@example.com|
|    Sofia|     Sales| 57496|                  6| 32|Female|    false|elizabeth@example...|
| Scarlett|   Finance|112321|                 11| 34|  Male|     true|   avery@example.com|
|     Aria|   Finance| 95054|                 11| 52|  Male|     true|   sofia@example.com|
|Elizabeth|     Sales|116997|                 15| 50|Female|     true|    ella@example.com|
|   Evelyn| Marketing| 90404|                  1| 48|  Male|    false| madison@example.com|
|      Ava|        IT|119438|                  1| 40|  Male|    false|scarlett@example.com|
|     Ella|     Sales| 83346|                 11| 47|Female|     true|victoria@example.com|
|   Olivia|     Sales| 51564|                 11| 53|Female|    false|    aria@example.com|
+---------+----------+------+-------------------+---+------+---------+--------------------+

In [65]:
df_emp_data.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- Years_of_Experience: integer (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Full_Time: boolean (nullable = true)
 |-- Email: string (nullable = true)

In [66]:
# GroupBy
# Grouped to find the maximum salary
df_emp_data.groupBy('Name').sum().show()

+---------+-----------+------------------------+--------+
|     Name|sum(Salary)|sum(Years_of_Experience)|sum(Age)|
+---------+-----------+------------------------+--------+
| Isabella|      68541|                       1|      50|
|      Ava|     119438|                       1|      40|
| Victoria|      68512|                       4|      52|
|     Ella|      83346|                      11|      47|
|   Evelyn|      90404|                       1|      48|
|  Madison|     110771|                       3|      25|
|      Mia|      77505|                      12|      38|
|    Emily|      98046|                       4|      41|
|   Olivia|      51564|                      11|      53|
|     Emma|      72663|                       8|      35|
| Scarlett|     112321|                      11|      34|
|Elizabeth|     116997|                      15|      50|
|   Amelia|      94510|                       7|      40|
|    Sofia|      57496|                       6|      32|
|  Abigail|      61821|                      11|      44|
|   Sophia|     103130|                      10|      42|
|    Avery|      53862|                       2|      39|
|     Aria|      95054|                      11|      52|
|Charlotte|      71856|                       9|      55|
|   Harper|      50922|                      11|      43|
+---------+-----------+------------------------+--------+

In [67]:
# Group by department to see who makes more money
df_emp_data.groupBy('Department').sum().show()

+----------+-----------+------------------------+--------+
|Department|sum(Salary)|sum(Years_of_Experience)|sum(Age)|
+----------+-----------+------------------------+--------+
|     Sales|     463455|                      64|     267|
|        HR|     363090|                      38|     217|
|   Finance|     207375|                      22|      86|
| Marketing|     338228|                       9|     175|
|        IT|     286611|                      16|     115|
+----------+-----------+------------------------+--------+

In [68]:
# Group by department to see who average money
df_emp_data.groupBy('Department').mean().show()

+----------+-----------+------------------------+------------------+
|Department|avg(Salary)|avg(Years_of_Experience)|          avg(Age)|
+----------+-----------+------------------------+------------------+
|     Sales|    77242.5|      10.666666666666666|              44.5|
|        HR|    72618.0|                     7.6|              43.4|
|   Finance|   103687.5|                    11.0|              43.0|
| Marketing|    84557.0|                    2.25|             43.75|
|        IT|    95537.0|       5.333333333333333|38.333333333333336|
+----------+-----------+------------------------+------------------+

In [69]:
# Group by department to see how many departments
df_emp_data.groupBy('Department').count().show()

+----------+-----+
|Department|count|
+----------+-----+
|     Sales|    6|
|        HR|    5|
|   Finance|    2|
| Marketing|    4|
|        IT|    3|
+----------+-----+

In [70]:
# Let us aggregate to see the total expenditure
df_emp_data.agg({'Salary':'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|    1658759|
+-----------+

In [71]:
# Who is the max salary
from pyspark.sql.functions import col, max

In [72]:
df_emp_data.orderBy(col("Salary").desc()).show()

+---------+----------+------+-------------------+---+------+---------+--------------------+
|     Name|Department|Salary|Years_of_Experience|Age|Gender|Full_Time|               Email|
+---------+----------+------+-------------------+---+------+---------+--------------------+
|      Ava|        IT|119438|                  1| 40|  Male|    false|scarlett@example.com|
|Elizabeth|     Sales|116997|                 15| 50|Female|     true|    ella@example.com|
| Scarlett|   Finance|112321|                 11| 34|  Male|     true|   avery@example.com|
|  Madison| Marketing|110771|                  3| 25|Female|    false|  olivia@example.com|
|   Sophia|     Sales|103130|                 10| 42|  Male|     true|     ava@example.com|
|    Emily|        HR| 98046|                  4| 41|  Male|     true|     mia@example.com|
|     Aria|   Finance| 95054|                 11| 52|  Male|     true|   sofia@example.com|
|   Amelia|        IT| 94510|                  7| 40|  Male|    false|  amelia@example.com|
|   Evelyn| Marketing| 90404|                  1| 48|  Male|    false| madison@example.com|
|     Ella|     Sales| 83346|                 11| 47|Female|     true|victoria@example.com|
|      Mia|        HR| 77505|                 12| 38|  Male|    false|    emma@example.com|
|     Emma|        IT| 72663|                  8| 35|  Male|     true|charlotte@example...|
|Charlotte|        HR| 71856|                  9| 55|Female|    false|   emily@example.com|
| Isabella| Marketing| 68541|                  1| 50|Female|    false|isabella@example.com|
| Victoria| Marketing| 68512|                  4| 52|Female|    false| abigail@example.com|
|  Abigail|        HR| 61821|                 11| 44|  Male|     true|  evelyn@example.com|
|    Sofia|     Sales| 57496|                  6| 32|Female|    false|elizabeth@example...|
|    Avery|        HR| 53862|                  2| 39|Female|     true|  harper@example.com|
|   Olivia|     Sales| 51564|                 11| 53|Female|    false|    aria@example.com|
|   Harper|     Sales| 50922|                 11| 43|  Male|    false|  sophia@example.com|
+---------+----------+------+-------------------+---+------+---------+--------------------+

In [73]:
# Using Spark SQL

df_emp_data.createTempView("employees")

AnalysisException: [TEMP_TABLE_OR_VIEW_ALREADY_EXISTS] Cannot create the temporary view `employees` because it already exists.
Choose a different name, drop or replace the existing view,  or add the IF NOT EXISTS clause to tolerate pre-existing views.

In [74]:
spark.sql(
    """
    SELECT Name, Salary, Years_of_Experience, Age
    FROM employees
    ORDER BY Salary DESC
    """
).show()

+---------+------+-------------------+---+
|     Name|Salary|Years_of_Experience|Age|
+---------+------+-------------------+---+
|      Ava|119438|                  1| 40|
|Elizabeth|116997|                 15| 50|
| Scarlett|112321|                 11| 34|
|  Madison|110771|                  3| 25|
|   Sophia|103130|                 10| 42|
|    Emily| 98046|                  4| 41|
|     Aria| 95054|                 11| 52|
|   Amelia| 94510|                  7| 40|
|   Evelyn| 90404|                  1| 48|
|     Ella| 83346|                 11| 47|
|      Mia| 77505|                 12| 38|
|     Emma| 72663|                  8| 35|
|Charlotte| 71856|                  9| 55|
| Isabella| 68541|                  1| 50|
| Victoria| 68512|                  4| 52|
|  Abigail| 61821|                 11| 44|
|    Sofia| 57496|                  6| 32|
|    Avery| 53862|                  2| 39|
|   Olivia| 51564|                 11| 53|
|   Harper| 50922|                 11| 43|
+---------+------+-------------------+---+

In [76]:
# We can also group by and make department and find the max for each columns
df_grouped = df_emp_data.groupBy("Department").agg(
    max("Salary").alias("max_Salary"),
    max("Years_of_Experience").alias("max_Years_of_Experience"),
    max("Age").alias("max_Age")
)


df_sorted = df_grouped.orderBy(col("max_salary").desc())
df_sorted.show()

+----------+----------+-----------------------+-------+
|Department|max_Salary|max_Years_of_Experience|max_Age|
+----------+----------+-----------------------+-------+
|        IT|    119438|                      8|     40|
|     Sales|    116997|                     15|     53|
|   Finance|    112321|                     11|     52|
| Marketing|    110771|                      4|     52|
|        HR|     98046|                     12|     55|
+----------+----------+-----------------------+-------+

In [78]:
df_emp_data.groupBy("Name").avg().show()

+---------+-----------+------------------------+--------+
|     Name|avg(Salary)|avg(Years_of_Experience)|avg(Age)|
+---------+-----------+------------------------+--------+
| Isabella|    68541.0|                     1.0|    50.0|
|      Ava|   119438.0|                     1.0|    40.0|
| Victoria|    68512.0|                     4.0|    52.0|
|     Ella|    83346.0|                    11.0|    47.0|
|   Evelyn|    90404.0|                     1.0|    48.0|
|  Madison|   110771.0|                     3.0|    25.0|
|      Mia|    77505.0|                    12.0|    38.0|
|    Emily|    98046.0|                     4.0|    41.0|
|   Olivia|    51564.0|                    11.0|    53.0|
|     Emma|    72663.0|                     8.0|    35.0|
| Scarlett|   112321.0|                    11.0|    34.0|
|Elizabeth|   116997.0|                    15.0|    50.0|
|   Amelia|    94510.0|                     7.0|    40.0|
|    Sofia|    57496.0|                     6.0|    32.0|
|  Abigail|    61821.0|                    11.0|    44.0|
|   Sophia|   103130.0|                    10.0|    42.0|
|    Avery|    53862.0|                     2.0|    39.0|
|     Aria|    95054.0|                    11.0|    52.0|
|Charlotte|    71856.0|                     9.0|    55.0|
|   Harper|    50922.0|                    11.0|    43.0|
+---------+-----------+------------------------+--------+

## Exploring the MLlib Library of PySpark

In [79]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Practicing").getOrCreate()

24/02/24 17:19:39 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

In [81]:
## Read the dataset
training = spark.read.csv("employees_data_enhanced.csv", header=True,inferSchema=True)

In [82]:
# Show the training data
training.show()

+---------+----------+------+-------------------+---+------+---------+--------------------+
|     Name|Department|Salary|Years_of_Experience|Age|Gender|Full_Time|               Email|
+---------+----------+------+-------------------+---+------+---------+--------------------+
|      Mia|        HR| 77505|                 12| 38|  Male|    false|    emma@example.com|
|  Madison| Marketing|110771|                  3| 25|Female|    false|  olivia@example.com|
|   Sophia|     Sales|103130|                 10| 42|  Male|     true|     ava@example.com|
| Isabella| Marketing| 68541|                  1| 50|Female|    false|isabella@example.com|
|   Harper|     Sales| 50922|                 11| 43|  Male|    false|  sophia@example.com|
|    Emily|        HR| 98046|                  4| 41|  Male|     true|     mia@example.com|
|     Emma|        IT| 72663|                  8| 35|  Male|     true|charlotte@example...|
|   Amelia|        IT| 94510|                  7| 40|  Male|    false|  amelia@example.com|
|  Abigail|        HR| 61821|                 11| 44|  Male|     true|  evelyn@example.com|
| Victoria| Marketing| 68512|                  4| 52|Female|    false| abigail@example.com|
|    Avery|        HR| 53862|                  2| 39|Female|     true|  harper@example.com|
|Charlotte|        HR| 71856|                  9| 55|Female|    false|   emily@example.com|
|    Sofia|     Sales| 57496|                  6| 32|Female|    false|elizabeth@example...|
| Scarlett|   Finance|112321|                 11| 34|  Male|     true|   avery@example.com|
|     Aria|   Finance| 95054|                 11| 52|  Male|     true|   sofia@example.com|
|Elizabeth|     Sales|116997|                 15| 50|Female|     true|    ella@example.com|
|   Evelyn| Marketing| 90404|                  1| 48|  Male|    false| madison@example.com|
|      Ava|        IT|119438|                  1| 40|  Male|    false|scarlett@example.com|
|     Ella|     Sales| 83346|                 11| 47|Female|     true|victoria@example.com|
|   Olivia|     Sales| 51564|                 11| 53|Female|    false|    aria@example.com|
+---------+----------+------+-------------------+---+------+---------+--------------------+

In [84]:
training.printSchema()
training.columns

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- Years_of_Experience: integer (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Full_Time: boolean (nullable = true)
 |-- Email: string (nullable = true)

['Name',
 'Department',
 'Salary',
 'Years_of_Experience',
 'Age',
 'Gender',
 'Full_Time',
 'Email']

In [89]:
## Assembling the features
from pyspark.ml.feature import VectorAssembler
featureAssembler = VectorAssembler(inputCols=["Age", "Years_of_Experience"], outputCol="Independent features")

In [90]:
output = featureAssembler.transform(training)
output.show()

+---------+----------+------+-------------------+---+------+---------+--------------------+--------------------+
|     Name|Department|Salary|Years_of_Experience|Age|Gender|Full_Time|               Email|Independent features|
+---------+----------+------+-------------------+---+------+---------+--------------------+--------------------+
|      Mia|        HR| 77505|                 12| 38|  Male|    false|    emma@example.com|         [38.0,12.0]|
|  Madison| Marketing|110771|                  3| 25|Female|    false|  olivia@example.com|          [25.0,3.0]|
|   Sophia|     Sales|103130|                 10| 42|  Male|     true|     ava@example.com|         [42.0,10.0]|
| Isabella| Marketing| 68541|                  1| 50|Female|    false|isabella@example.com|          [50.0,1.0]|
|   Harper|     Sales| 50922|                 11| 43|  Male|    false|  sophia@example.com|         [43.0,11.0]|
|    Emily|        HR| 98046|                  4| 41|  Male|     true|     mia@example.com|          [41.0,4.0]|
|     Emma|        IT| 72663|                  8| 35|  Male|     true|charlotte@example...|          [35.0,8.0]|
|   Amelia|        IT| 94510|                  7| 40|  Male|    false|  amelia@example.com|          [40.0,7.0]|
|  Abigail|        HR| 61821|                 11| 44|  Male|     true|  evelyn@example.com|         [44.0,11.0]|
| Victoria| Marketing| 68512|                  4| 52|Female|    false| abigail@example.com|          [52.0,4.0]|
|    Avery|        HR| 53862|                  2| 39|Female|     true|  harper@example.com|          [39.0,2.0]|
|Charlotte|        HR| 71856|                  9| 55|Female|    false|   emily@example.com|          [55.0,9.0]|
|    Sofia|     Sales| 57496|                  6| 32|Female|    false|elizabeth@example...|          [32.0,6.0]|
| Scarlett|   Finance|112321|                 11| 34|  Male|     true|   avery@example.com|         [34.0,11.0]|
|     Aria|   Finance| 95054|                 11| 52|  Male|     true|   sofia@example.com|         [52.0,11.0]|
|Elizabeth|     Sales|116997|                 15| 50|Female|     true|    ella@example.com|         [50.0,15.0]|
|   Evelyn| Marketing| 90404|                  1| 48|  Male|    false| madison@example.com|          [48.0,1.0]|
|      Ava|        IT|119438|                  1| 40|  Male|    false|scarlett@example.com|          [40.0,1.0]|
|     Ella|     Sales| 83346|                 11| 47|Female|     true|victoria@example.com|         [47.0,11.0]|
|   Olivia|     Sales| 51564|                 11| 53|Female|    false|    aria@example.com|         [53.0,11.0]|
+---------+----------+------+-------------------+---+------+---------+--------------------+--------------------+

In [91]:
output.columns

['Name',
 'Department',
 'Salary',
 'Years_of_Experience',
 'Age',
 'Gender',
 'Full_Time',
 'Email',
 'Independent features']

In [92]:
finalized_data = output.select("Independent features", "Salary")
finalized_data.show()

+--------------------+------+
|Independent features|Salary|
+--------------------+------+
|         [38.0,12.0]| 77505|
|          [25.0,3.0]|110771|
|         [42.0,10.0]|103130|
|          [50.0,1.0]| 68541|
|         [43.0,11.0]| 50922|
|          [41.0,4.0]| 98046|
|          [35.0,8.0]| 72663|
|          [40.0,7.0]| 94510|
|         [44.0,11.0]| 61821|
|          [52.0,4.0]| 68512|
|          [39.0,2.0]| 53862|
|          [55.0,9.0]| 71856|
|          [32.0,6.0]| 57496|
|         [34.0,11.0]|112321|
|         [52.0,11.0]| 95054|
|         [50.0,15.0]|116997|
|          [48.0,1.0]| 90404|
|          [40.0,1.0]|119438|
|         [47.0,11.0]| 83346|
|         [53.0,11.0]| 51564|
+--------------------+------+

In [93]:
from pyspark.ml.regression import LinearRegression
# Training test split
train_data, test_data = finalized_data.randomSplit([0.75,0.25])

regressor=LinearRegression(featuresCol="Independent features", labelCol='Salary')
regressor = regressor.fit(train_data)

24/02/24 17:32:13 WARN Instrumentation: [8893a98e] regParam is zero, which might cause numerical instability and overfitting.
24/02/24 17:32:13 WARN InstanceBuilder: Failed to load implementation from:dev.ludovic.netlib.blas.JNIBLAS
24/02/24 17:32:13 WARN InstanceBuilder: Failed to load implementation from:dev.ludovic.netlib.lapack.JNILAPACK

In [94]:
### Coefficients
regressor.coefficients

DenseVector([-1459.567, 1295.6875])

In [95]:
### Intercepts
regressor.intercept

139561.5255700838

In [96]:
pred_results = regressor.evaluate(test_data)

In [97]:
pred_results.predictions.show()

+--------------------+------+------------------+
|Independent features|Salary|        prediction|
+--------------------+------+------------------+
|          [32.0,6.0]| 57496|100629.50644167617|
|          [35.0,8.0]| 72663| 98842.18038799867|
|         [38.0,12.0]| 77505| 99646.22927638819|
|          [40.0,7.0]| 94510| 90248.65792405751|
|          [41.0,4.0]| 98046|  84902.0285123754|
|         [42.0,10.0]|103130| 91216.58633999503|
|         [44.0,11.0]| 61821| 89593.13981386552|
|          [48.0,1.0]| 90404| 70797.99710920417|
+--------------------+------+------------------+

In [98]:
# Let us check the error
pred_results.meanAbsoluteError, pred_results.meanSquaredError

(21018.848254287055, 565577805.5744939)

In [100]:
# Let us save the model

# Specifying the path where I save the model in DBFS
model_path = "./model_data"

# Save the model
regressor.write().overwrite().save(model_path)